vecnode/esp32js/hw/riscv/esp32c3_picsimlab.c
uint32_t *qemu_picsimlab_get_internals(int cfg) {
  switch (cfg) {
  case QEMU_INTERNAL_STRAP:
    return &global_s->gpio.parent.strap_mode;
    break;
  case QEMU_INTERNAL_GPIO_IN_SEL:
    return global_s->gpio.parent.gpio_in_sel;
    break;
  case QEMU_INTERNAL_GPIO_OUT_SEL:
    return global_s->gpio.parent.gpio_out_sel;
    break;
  case QEMU_INTERNAL_IOMUX_GPIOS:
    return global_s->iomux.parent.muxgpios;
    break;

  case QEMU_INTERNAL_LEDC_CHANNEL_CONF:
    return global_s->ledc.channel_conf0_reg;
    break;
  case QEMU_INTERNAL_LEDC_TIMER_FREQ:
    return global_s->ledc.freq;
    break;
  case QEMU_INTERNAL_LEDC_CHANNEL_DUTY:
    return (uint32_t *) global_s->ledc.duty;
    break;
  
  case QEMU_INTERNAL_UART0_BAUD:
    return &global_s->uart[0].parent.baud_rate;
    break;
  case QEMU_INTERNAL_UART1_BAUD:
    return &global_s->uart[1].parent.baud_rate;
    break;

  default:
    printf("Invalid internal request\n"); 
    break;
  }
  return NULL;
}

void uart_receive(void *opaque, const uint8_t *buf, int size);
int uart_can_receive(void *opaque);

void qemu_picsimlab_uart_receive(const int id, const uint8_t *buf, int size){
   uart_receive((void *) &global_s->uart[id], buf, size);
}

uint32_t qemu_picsimlab_get_TIOCM(void)
{  
   ESP32UARTState *s = ESP32_UART(&(global_s->uart[0].parent));

   uint32_t state = 0;
   
#ifdef _WIN32
   WinChardev *ws = WIN_CHARDEV(s->chr.chr);

   if (ws->file != INVALID_HANDLE_VALUE) {
     long unsigned int wstate;
     if(GetCommModemStatus(ws->file, &wstate)){
       if(wstate & MS_DSR_ON) state |= CHR_TIOCM_DSR;
       if(wstate & MS_CTS_ON) state |= CHR_TIOCM_CTS;
     }
     else{
       printf("GetCommModemStatus Erro %li\n", GetLastError());
     }
    }
#else
   qemu_chr_fe_ioctl(&s->chr, CHR_IOCTL_SERIAL_GET_TIOCM, &state); 
#endif
  
   return state;
}


static void place_holder(int pin,int value){};
static int place_holder2(const uint8_t id, const uint8_t addr, const uint16_t event){return 0;};
static uint8_t place_holder3(const uint8_t id, const uint16_t event){return 0;};
static void place_holder4(const uint8_t id, const uint8_t value){};
static void place_holder5(const uint8_t channel, const uint32_t config0, const uint32_t value){};

void (*picsimlab_write_pin)(int pin,int value) = place_holder;
void (*picsimlab_dir_pin)(int pin,int value) = place_holder;
int (*picsimlab_i2c_event)(const uint8_t id, const uint8_t addr, const uint16_t event) = place_holder2;
uint8_t (*picsimlab_spi_event)(const uint8_t id, const uint16_t event) = place_holder3;
void (*picsimlab_uart_tx_event)(const uint8_t id, const uint8_t value) = place_holder4;
static const short int * pinmap = NULL;
void (*picsimlab_rmt_event)(const uint8_t channel, const uint32_t config0, const uint32_t value) = place_holder5;

void qemu_picsimlab_register_callbacks(void * arg)
{
  const callbacks_t * callbacks = (const callbacks_t *) arg;

  picsimlab_write_pin = callbacks->picsimlab_write_pin;
  picsimlab_dir_pin = callbacks->picsimlab_dir_pin; 
  picsimlab_i2c_event = callbacks->picsimlab_i2c_event;
  picsimlab_spi_event = callbacks->picsimlab_spi_event;
  picsimlab_uart_tx_event = callbacks->picsimlab_uart_tx_event;
  pinmap = callbacks->pinmap;
  picsimlab_rmt_event = callbacks->picsimlab_rmt_event;
}

void qemu_picsimlab_set_pin(int pin,int value)
{
   //qemu_mutex_lock_iothread ();
   if (value){
      qemu_irq_raise (pin_irq[pin]);
   }
   else{
      qemu_irq_lower (pin_irq[pin]);
   }
   //qemu_mutex_unlock_iothread ();
}

void qemu_picsimlab_set_apin(int chn,int value)
{
   Esp32c3SarAdcState *s = ESP32C3_SARADC(&(global_s->saradc));
   s->ADC_values[chn] = value;
}

int qemu_picsimlab_flash_dump( int64_t offset, void *buf, int bytes)
{
    if (global_s->cache.flash_blk){
       return blk_pread(global_s->cache.flash_blk,offset,bytes,buf,0);
    }
   return 0;
}

static void
pout_irq_handler(void *opaque, int n, int level)
{
   picsimlab_write_pin(n,level);
}

static void
pdir_irq_handler(void *opaque, int n, int dir)
{
   picsimlab_dir_pin(n, dir);
}

static void
psync_irq_handler(void *opaque, int n, int dir)
{
   picsimlab_dir_pin(-1, dir);
}
/*
static void
spi_cs_irq_handler(void *opaque, int n, int level)
{
    picsimlab_spi_event(n >> 2, ((((n & 3)<<1)|level)<<8)|0x01);
}
*/

static bool addr_in_range(hwaddr addr, hwaddr start, hwaddr end)
{
    return addr >= start && addr < end;
}

static uint64_t esp32c3_io_read(void *opaque, hwaddr addr, unsigned int size)
{
    if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_RTC_I2C_BASE, DR_REG_RTC_I2C_BASE + 0x100)) {
        return (uint32_t) 0xffffff;
    } else if (addr + ESP32C3_IO_START_ADDR == DR_REG_SYSCON_BASE + A_SYSCON_ORIGIN_REG) {
        /* Return "QEMU" as a 32-bit value */
        return 0x51454d55;
    } else if (addr + ESP32C3_IO_START_ADDR == DR_REG_SYSCON_BASE + A_SYSCON_RND_DATA_REG) {
        /* Return a random 32-bit value */
        static bool init = false;
        if (!init) {
            srand(time(NULL));
            init = true;
        }
        return rand();
    } else if (addr + ESP32C3_IO_START_ADDR == DR_REG_ASSIST_DEBUG_BASE + A_ASSIST_DEBUG_CORE_0_DEBUG_MODE_REG) {
        return 0;
    } else {
#if ESP32C3_IO_WARNING
        if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_SYSCON_BASE,DR_REG_SYSCON_BASE + 0x1000)){
            warn_report("[ESP32-C3] SYSCON          Unsupported read to $%08lx\n", ESP32C3_IO_START_ADDR + addr);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_FE_BASE,DR_REG_FE_BASE + 0x1000)){
            warn_report("[ESP32-C3] FE              Unsupported read to $%08lx\n", ESP32C3_IO_START_ADDR + addr);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_BB_BASE,DR_REG_BB_BASE + 0x1000)){
            warn_report("[ESP32-C3] BB              Unsupported read to $%08lx\n", ESP32C3_IO_START_ADDR + addr);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_NRX_BASE,DR_REG_NRX_BASE + 0x1000)){
            warn_report("[ESP32-C3] NRX             Unsupported read to $%08lx\n", ESP32C3_IO_START_ADDR + addr);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_SPI0_BASE,DR_REG_SPI0_BASE + 0x1000)){
            warn_report("[ESP32-C3] SPI0            Unsupported read to $%08lx\n", ESP32C3_IO_START_ADDR + addr);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_SENSITIVE_BASE,DR_REG_SENSITIVE_BASE + 0x1000)){
            warn_report("[ESP32-C3] SENSITIVE       Unsupported read to $%08lx\n", ESP32C3_IO_START_ADDR + addr);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_ASSIST_DEBUG_BASE,DR_REG_ASSIST_DEBUG_BASE + 0x1000)){
            warn_report("[ESP32-C3] ASSIST DEBUG    Unsupported read to $%08lx\n", ESP32C3_IO_START_ADDR + addr);  
        }        
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_FE2_BASE,DR_REG_FE2_BASE + 0x1000)){
            warn_report("[ESP32-C3] FE2             Unsupported read to $%08lx\n", ESP32C3_IO_START_ADDR + addr);  
        }
        else{
            warn_report("[ESP32-C3] <UNKNOWN>       Unsupported read to $%08lx\n", ESP32C3_IO_START_ADDR + addr);
        }
#endif
    }
    return 0;
}

static void esp32c3_io_write(void *opaque, hwaddr addr, uint64_t value, unsigned int size)
{
#if ESP32C3_IO_WARNING
        if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_SYSCON_BASE,DR_REG_SYSCON_BASE + 0x1000)){
            warn_report("[ESP32-C3] SYSCON          Unsupported write to $%08lx = %08lx\n", ESP32C3_IO_START_ADDR + addr, value);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_FE_BASE,DR_REG_FE_BASE + 0x1000)){
            warn_report("[ESP32-C3] FE              Unsupported write to $%08lx = %08lx\n", ESP32C3_IO_START_ADDR + addr, value);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_BB_BASE,DR_REG_BB_BASE + 0x1000)){
            warn_report("[ESP32-C3] BB              Unsupported write to $%08lx = %08lx\n", ESP32C3_IO_START_ADDR + addr, value);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_NRX_BASE,DR_REG_NRX_BASE + 0x1000)){
            warn_report("[ESP32-C3] NRX             Unsupported write to $%08lx = %08lx\n", ESP32C3_IO_START_ADDR + addr, value);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_SPI0_BASE,DR_REG_SPI0_BASE + 0x1000)){
            warn_report("[ESP32-C3] SPI0            Unsupported write to $%08lx = %08lx\n", ESP32C3_IO_START_ADDR + addr, value);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_SENSITIVE_BASE,DR_REG_SENSITIVE_BASE + 0x1000)){
            warn_report("[ESP32-C3] SENSITIVE       Unsupported write to $%08lx = %08lx\n", ESP32C3_IO_START_ADDR + addr, value);  
        }
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_ASSIST_DEBUG_BASE,DR_REG_ASSIST_DEBUG_BASE + 0x1000)){
            warn_report("[ESP32-C3] ASSIST DEBUG    Unsupported write to $%08lx = %08lx\n", ESP32C3_IO_START_ADDR + addr, value);  
        }        
        else if (addr_in_range(addr + ESP32C3_IO_START_ADDR, DR_REG_FE2_BASE,DR_REG_FE2_BASE + 0x1000)){
            warn_report("[ESP32-C3] FE2             Unsupported write to $%08lx = %08lx\n", ESP32C3_IO_START_ADDR + addr, value);  
        }
        else{
            warn_report("[ESP32-C3] <UNKNOWN>       Unsupported write to $%08lx = %08lx\n", ESP32C3_IO_START_ADDR + addr, value);
        }
#endif
} 


/* Define operations for I/OS */
static const MemoryRegionOps esp32c3_io_ops = {
    .read =  esp32c3_io_read,
    .write = esp32c3_io_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
};


/**
 * @brief Callback invoked when SoC's ESP32C3_RESET_GPIO_NAME pin is toggled
 */
static void esp32c3_reset_request(void* opaque, int n, int level)
{
    if (level) {
        ShutdownCause cause = SHUTDOWN_CAUSE_GUEST_RESET;
        qemu_system_reset_request(cause);
    }
}


static void esp32c3_init_spi_flash(Esp32C3MachineState *ms, BlockBackend* blk)
{
    DeviceState *spi_master = DEVICE(&ms->spi1);
    BusState* spi_bus = qdev_get_child_bus(spi_master, "spi");
    const char* flash_model = NULL;
    int64_t image_size = blk_getlength(blk);

    switch (image_size) {
        case 2 * MB:
            flash_model = "w25x16";
            break;
        case 4 * MB:
            flash_model = "gd25q32";
            break;
        case 8 * MB:
            flash_model = "gd25q64";
            break;
        case 16 * MB:
            flash_model = "is25lp128";
            break;
        default:
            error_report("Drive size error: only 2, 4, 8, and 16MB images are supported");
            return;
    }

    /* Create the SPI flash model */
    DeviceState *flash_dev = qdev_new(flash_model);
    qdev_prop_set_drive(flash_dev, "drive", blk);
    qdev_prop_set_uint8(flash_dev, "cs", 1);

    /* Realize the SPI flash, its "drive" (blk) property must already be set! */
    qdev_realize(flash_dev, spi_bus, &error_fatal);
    qdev_connect_gpio_out_named(spi_master, SSI_GPIO_CS, 0,
                                qdev_get_gpio_in_named(flash_dev, SSI_GPIO_CS, 0));
}

static void esp32c3_add_unimp_device(MemoryRegion *dest, const char* name, hwaddr dport_base_addr, size_t size, uint32_t default_value)
{
    create_unimplemented_device_default_value(name, dport_base_addr, size, default_value);
}

