vecnode/esp32js/hw/riscv/esp32c3_picsimlab.c
/*
static void esp32c3_init_openeth(Esp32C3MachineState *ms)
{
    MemoryRegion* mr = NULL;
    SysBusDevice* sbd = NULL;

    MemoryRegion* sys_mem = get_system_memory();

    // Create a new OpenCores Ethernet component 
    DeviceState* open_eth_dev = qemu_create_nic_device("open_eth", true, NULL);
    if (!open_eth_dev) {
        return;
    }

    ms->eth = open_eth_dev;

    sbd = SYS_BUS_DEVICE(open_eth_dev);
    sysbus_realize(sbd, &error_fatal);

    // OpenCores Ethernet has two memory regions: one for registers and one for descriptors,
    //     we need to provide one I/O range for each of them 
    mr = sysbus_mmio_get_region(sbd, 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_EMAC_BASE, mr, 0);
    mr = sysbus_mmio_get_region(sbd, 1);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_EMAC_BASE + 0x400, mr, 0);

    sysbus_connect_irq(sbd, 0,
                        qdev_get_gpio_in(DEVICE(&ms->intmatrix), ETS_ETH_MAC_INTR_SOURCE));

}
*/


static void esp32c3_init_openeth(Esp32C3MachineState *ms)
{
    SysBusDevice *sbd;
    MemoryRegion* sys_mem = get_system_memory();
    
	const char* type_openeth = "open_eth";
	NICInfo *nd = qemu_find_nic_info(type_openeth, false, NULL);
	if(nd!=NULL) {
        hwaddr reg_base = DR_REG_EMAC_BASE;
        hwaddr desc_base = reg_base + 0x400;
        qemu_irq irq = qdev_get_gpio_in(DEVICE(&ms->intmatrix), ETS_ETH_MAC_INTR_SOURCE);
		DeviceState* open_eth_dev = qdev_new(type_openeth);
        ms->eth = open_eth_dev;
        qdev_set_nic_properties(open_eth_dev, nd);
        sbd = SYS_BUS_DEVICE(open_eth_dev);
        sysbus_realize_and_unref(sbd, &error_fatal);
        sysbus_connect_irq(sbd, 0, irq);
        memory_region_add_subregion(sys_mem, reg_base, sysbus_mmio_get_region(sbd, 0));
        memory_region_add_subregion(sys_mem, desc_base, sysbus_mmio_get_region(sbd, 1));
	}
	nd = qemu_find_nic_info(TYPE_ESP32C3_WIFI, false, NULL);
	if(nd!=NULL) {
            //get macaddres from efuse file
            device_cold_reset(DEVICE(&ms->efuse));
            char * mptr = (char *)&ms->efuse.parent.efuses.blocks.rd_mac_spi_sys_0;
            for(int i=0; i < 6 ; i++){
                ms->wifi.macaddr[i]=mptr[5-i];
            }
            
            qdev_set_nic_properties(DEVICE(&ms->wifi), nd);
            sbd = SYS_BUS_DEVICE(DEVICE(&ms->wifi));
            sysbus_realize_and_unref(sbd, &error_fatal);
            
            MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ms->wifi), 0);
            memory_region_add_subregion_overlap(sys_mem, DR_REG_WIFI_BASE, mr, 0);
            
            sysbus_connect_irq(SYS_BUS_DEVICE(&ms->wifi), 0,
                           qdev_get_gpio_in(DEVICE(&ms->intmatrix), ETS_WIFI_MAC_INTR_SOURCE));
    }
}


static void esp32c3_init_i2c(Esp32C3MachineState *ms)
{
    /* It mshould be possible to create an I2C device from the command line,
     * however for this to work the I2C bus must be reachable from sysbus-default.
     * At the moment the peripherals are added to an unrelated bus, to avoid being
     * reset on CPU reset.
     * If we find a way to decouple peripheral reset from sysbus reset,
     * we can move them to the sysbus and thus enable creation of i2c devices.
     */
    DeviceState *i2c_master = DEVICE(&ms->i2c);
    I2CBus* i2c_bus = I2C_BUS(qdev_get_child_bus(i2c_master, "i2c"));
    i2c_slave_create_simple(i2c_bus, "picsimlab_i2c", 0x00);

}

static void esp32c3_load_firmware(MachineState *machine)
{
    Esp32C3MachineState *ms = ESP32C3_MACHINE(machine);
    const char *bios_filename = NULL;

    if (machine->firmware) {
        bios_filename = machine->firmware;
    }

    if (machine->kernel_filename) {
        if (bios_filename) {
            qemu_log("Warning: both -bios and -kernel arguments specified. Only loading the the -kernel file.\n");
        }
        bios_filename = machine->kernel_filename;
    }

    if (bios_filename) {
        /* Since EspRISCVCPU doens't have a RISCVHartArrayState field, let's bake one on the stack. It will only be
         * used to get the type of the RISC-V CPU (32 or 64 bits) in `riscv_load_kernel` */
        RISCVHartArrayState hart = {
            .harts = &ms->soc.parent_obj,
            .num_harts = 1,
        };

        /* The function `riscv_load_kernel` won't load the ELF file at its entry point, so we have to look
         * for the ELF entry point manually here */
        uint64_t elf_entry = ESP32C3_RESET_ADDRESS;

        /* The entry point address should be populated regardless of the return value */
        load_elf_ram_sym(bios_filename, NULL, NULL, NULL,
                        &elf_entry, NULL, NULL, NULL, 0,
                        EM_RISCV, 1, 0, NULL, false, NULL);

        /* On failure, riscv_load_kernel exits the program */
        qemu_log("Loading kernel at address 0x%08" PRIx64 "\n", elf_entry);
        riscv_load_kernel(machine, &hart, elf_entry, false, NULL);
        if (elf_entry != ESP32C3_RESET_ADDRESS) {
            qdev_prop_set_uint64(DEVICE(&ms->soc), "resetvec", elf_entry);
        }
    } else {
        /* Open and load the "bios", which is the ROM binary, also named "first stage bootloader" */
        char *rom_binary = qemu_find_file(QEMU_FILE_TYPE_BIOS, "esp32c3-rom.bin");
        if (rom_binary == NULL) {
            error_report("Error: -bios argument not set, and ROM code binary not found (1)");
            exit(1);
        }

        /* Load ROM file at the reset address */
        int size = load_image_targphys_as(rom_binary, ESP32C3_RESET_ADDRESS, 0x60000, CPU(&ms->soc)->as);
        if (size < 0) {
            error_report("Error: could not load ROM binary '%s'", rom_binary);
            exit(1);
        }

        g_free(rom_binary);
    }
}


static void esp32c3_machine_init(MachineState *machine)
{
    /* First thing to do is to check if a drive format and a file ahve been passed through the command line.
     * In fact, we will emulate the SPI flash if `if=mtd` was given. To know this, we will need to use the
     * Global API's function `driver_get`. */
    BlockBackend* blk = NULL;
    DriveInfo *dinfo = drive_get(IF_MTD, 0, 0);
    if (dinfo) {
        /* MTD was given! We need to initialize and emulate SPI flash */
        qemu_log("Adding SPI flash device\n");
        blk = blk_by_legacy_dinfo(dinfo);
    } else {
        qemu_log("Not initializing SPI Flash\n");
    }

    /* Re-use the macro that checks and casts any generic/parent class to the real child instance */
    Esp32C3MachineState *ms = ESP32C3_MACHINE(machine);
    global_s = ms;

    /* Initialize SoC */
    object_initialize_child(OBJECT(ms), "soc", &ms->soc, TYPE_ESP_RISCV_CPU);
    qdev_prop_set_uint64(DEVICE(&ms->soc), "resetvec", ESP32C3_RESET_ADDRESS);

