vecnode/esp32js/hw/riscv/esp32c3_picsimlab.c
    /* RGB display realization */
    {
        /* Give the internal RAM memory region to the display */
        ms->rgb.intram = dram;
        sysbus_realize(SYS_BUS_DEVICE(&ms->rgb), &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ms->rgb), 0);
        memory_region_add_subregion_overlap(sys_mem, DR_REG_FRAMEBUF_BASE, mr, 0);
        memory_region_add_subregion_overlap(sys_mem, esp32c3_memmap[ESP32C3_MEMREGION_FRAMEBUF].base, &ms->rgb.vram, 0);
    }

    /* TWAI peripheral realization */
    sysbus_realize(SYS_BUS_DEVICE(&ms->twai), &error_fatal);
    MemoryRegion *twai_mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ms->twai), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_TWAI_BASE, twai_mr, 0);
    sysbus_connect_irq(SYS_BUS_DEVICE(&ms->twai), 0,
                       qdev_get_gpio_in(DEVICE(&ms->intmatrix), ETS_TWAI_INTR_SOURCE));

    /* SARADC realization */
    {
        qdev_realize(DEVICE(&ms->saradc), &ms->periph_bus, &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ms->saradc), 0);
        memory_region_add_subregion_overlap(sys_mem, DR_REG_APB_SARADC_BASE, mr, 0);
        sysbus_connect_irq(SYS_BUS_DEVICE(&ms->saradc), 0,
                           qdev_get_gpio_in(intmatrix_dev, ETS_APB_ADC_INTR_SOURCE));
    }

    /* LEDC realization */
    {
        sysbus_realize(SYS_BUS_DEVICE(&ms->ledc), &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ms->ledc), 0);
        memory_region_add_subregion_overlap(sys_mem, DR_REG_LEDC_BASE, mr, 0);
    }

    //'esp32c3_wifi.c',   DR_REG_WIFI_BASE

    /* ANA realization */
    {
        qdev_realize(DEVICE(&ms->ana), &ms->periph_bus, &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ms->ana), 0);
        memory_region_add_subregion_overlap(sys_mem, DR_REG_RTC_I2C_BASE, mr, 0);
    }

    /* PHYA realization */
    {
        qdev_realize(DEVICE(&ms->phya), &ms->periph_bus, &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ms->phya), 0);
        memory_region_add_subregion_overlap(sys_mem, DR_REG_PHYA_BASE, mr, 0);
    }  

    /* FE realization */
    {
        qdev_realize(DEVICE(&ms->fe), &ms->periph_bus, &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ms->fe), 0);
        memory_region_add_subregion_overlap(sys_mem, DR_REG_FE_BASE, mr, 0);
    }   

    /* PWR MANAGER realization */
    {
        qdev_realize(DEVICE(&ms->pwrmng), &ms->periph_bus, &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ms->pwrmng), 0);
        memory_region_add_subregion_overlap(sys_mem, DR_REG_PWR_MANAGER_BASE, mr, 0);
    }

    /* I2C realization */
    {
        qdev_realize(DEVICE(&ms->i2c), &ms->periph_bus, &error_fatal);
        MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ms->i2c), 0);
        memory_region_add_subregion_overlap(sys_mem, DR_REG_I2C_EXT_BASE, mr, 0);
        sysbus_connect_irq(SYS_BUS_DEVICE(&ms->i2c), 0,
                           qdev_get_gpio_in(intmatrix_dev, ETS_I2C_EXT0_INTR_SOURCE));
    }

    /* Initialize I2C support */ 
    esp32c3_init_i2c(ms);

    esp32c3_add_unimp_device(sys_mem, "esp32c3.sensitive", DR_REG_SENSITIVE_BASE, 0x1000,0);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.mmu", DR_REG_MMU_TABLE, 0x1000,0);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.dedicategpio", DR_REG_DEDICATED_GPIO_BASE, 0x1000,0);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.worldcntl", DR_REG_WORLD_CNTL_BASE, 0x1000,0);

    esp32c3_add_unimp_device(sys_mem, "esp32c3.spi0", DR_REG_SPI0_BASE, 0x1000,0);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.fe2", DR_REG_FE2_BASE, 0x1000,0);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.uhci0", DR_REG_UHCI0_BASE, 0x1000,0);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.rmt", DR_REG_RMT_BASE, 0x1000,0);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.ledc", DR_REG_LEDC_BASE, 0x1000,0);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.spi2", DR_REG_SPI2_BASE, 0x1000,0);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.twai", DR_REG_TWAI_BASE, 0x1000,0);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.i2s0", DR_REG_I2S0_BASE, 0x1000,0);

    esp32c3_add_unimp_device(sys_mem, "esp32c3.nrx", DR_REG_NRX_BASE  - 0x0C00, 0x1000,-1);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.bb", DR_REG_BB_BASE , 0x1000,-1);
    esp32c3_add_unimp_device(sys_mem, "esp32c3.aes_xts", DR_REG_AES_XTS_BASE, 0x1000,0);

    /* Register reset function so that it is called when `system_reset` is invoked in QEMU monitor */
    //qemu_register_reset(esp32c3_reset_request, ms);


    //PICSimLab gpio map

//ESP32-DevKitC V4
    psync_irq = qemu_allocate_irqs (psync_irq_handler, NULL, 1);
    qdev_connect_gpio_out_named(DEVICE(&ms->gpio), ESP32_GPIOS_SYNC, 0 , psync_irq[0]);
    qdev_connect_gpio_out_named(DEVICE(&ms->iomux), ESP32_IOMUX_SYNC, 0 , psync_irq[0]);
    qdev_connect_gpio_out_named(DEVICE(&ms->ledc), ESP32C3_LEDC_SYNC, 0 , psync_irq[0]);

/*
    spi_cs_irq = qemu_allocate_irqs (spi_cs_irq_handler, NULL, 8);

    qdev_connect_gpio_out_named(DEVICE(&ms->spi[2]), SSI_GPIO_CS, 0 , spi_cs_irq[0]);
    qdev_connect_gpio_out_named(DEVICE(&ms->spi[2]), SSI_GPIO_CS, 1 , spi_cs_irq[1]);
    qdev_connect_gpio_out_named(DEVICE(&ms->spi[2]), SSI_GPIO_CS, 2 , spi_cs_irq[2]);

    qdev_connect_gpio_out_named(DEVICE(&ms->spi[3]), SSI_GPIO_CS, 0 , spi_cs_irq[4]);
    qdev_connect_gpio_out_named(DEVICE(&ms->spi[3]), SSI_GPIO_CS, 1 , spi_cs_irq[5]);
    qdev_connect_gpio_out_named(DEVICE(&ms->spi[3]), SSI_GPIO_CS, 2 , spi_cs_irq[6]);
*/

    if(pinmap){
      pdir_irq = qemu_allocate_irqs (pdir_irq_handler, NULL, pinmap[0]+1 );
      pout_irq = qemu_allocate_irqs (pout_irq_handler, NULL, pinmap[0]+1);
      for(int pin = 1; pin < (pinmap[0]+1); pin++){
        if(pinmap[pin] >= 0){
            qdev_connect_gpio_out_named(DEVICE(&ms->gpio), ESP32_GPIOS, pinmap[pin], pout_irq[pin]);
            qdev_connect_gpio_out_named(DEVICE(&ms->gpio), ESP32_GPIOS_DIR, pinmap[pin] , pdir_irq[pin]);
            pin_irq[pin]=qdev_get_gpio_in_named(DEVICE(&ms->gpio), ESP32_GPIOS_IN, pinmap[pin]);
        }
      } 
    }
}


/* Initialize machine type */
static void esp32c3_machine_class_init(ObjectClass *oc, void *data)
{
    MachineClass *mc = MACHINE_CLASS(oc);
    mc->desc = "Espressif ESP32-C3 machine";
    mc->default_cpu_type = TYPE_ESP_RISCV_CPU;
    mc->init = esp32c3_machine_init;
    mc->max_cpus = 1;
    mc->default_cpus = 1;
    // 0x4f600
    mc->default_ram_size = 400 * 1024;
}

/* Create a new type of machine ("child class") */
static const TypeInfo esp32c3_info = {
    .name = TYPE_ESP32C3_MACHINE,
    /* Specify the parent class, i.e. the class we derivate from */
    .parent = TYPE_MACHINE,
    /* Real size in bytes of our machine instance */
    .instance_size = sizeof(Esp32C3MachineState),
    /* Override the init function to one we defined above */
    .class_init = esp32c3_machine_class_init,
};

static void esp32c3_machine_type_init(void)
{
    type_register_static(&esp32c3_info);
}

type_init(esp32c3_machine_type_init);
